NDBCK/Ansluta-Remote-Controller/AnslutaDemoCode/cc2500_VAL.h
/***************************************************************
 *  SmartRF Studio(tm) Export
 *
 *  Radio register settings specifed with C-code
 *  compatible #define statements.
 *
 *  RF device: CC2500
 *
 ***************************************************************/

#define VAL_IOCFG2           0x29
#define VAL_IOCFG0           0x06
#define VAL_PKTLEN           0xFF
#define VAL_PKTCTRL1         0x04
#define VAL_PKTCTRL0         0x05
#define VAL_ADDR             0x01
#define VAL_CHANNR           0x10
#define VAL_FSCTRL1          0x09
#define VAL_FSCTRL0          0x00
#define VAL_FREQ2            0x5D
#define VAL_FREQ1            0x93
#define VAL_FREQ0            0xB1
#define VAL_MDMCFG4          0x2D
#define VAL_MDMCFG3          0x3B
#define VAL_MDMCFG2          0x73   //MSK, No Manchester 
#define VAL_MDMCFG1          0xA2
#define VAL_MDMCFG0          0xF8
#define VAL_DEVIATN          0x01
#define VAL_MCSM2            0x07
#define VAL_MCSM1            0x30
#define VAL_MCSM0            0x18
#define VAL_FOCCFG           0x1D
#define VAL_BSCFG            0x1C
#define VAL_AGCCTRL2         0xC7
#define VAL_AGCCTRL1         0x00
#define VAL_AGCCTRL0         0xB2
#define VAL_WOREVT1          0x87
#define VAL_WOREVT0          0x6B
#define VAL_WORCTRL          0xF8
#define VAL_FREND1           0xB6
#define VAL_FREND0           0x10
#define VAL_FSCAL3           0xEA
#define VAL_FSCAL2           0x0A
#define VAL_FSCAL1           0x00
#define VAL_FSCAL0           0x11
#define VAL_RCCTRL1          0x41
#define VAL_RCCTRL0          0x00
#define VAL_FSTEST           0x59
#define VAL_TEST2            0x88
#define VAL_TEST1            0x31
#define VAL_TEST0            0x0B
#define VAL_DAFUQ            0xFF
